app/Controllers/Buku.php

SELECT *
FROM `buku`
 LIMIT 9, 3
SELECT COUNT(*) AS `numrows`
FROM `buku`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_buku') ? $this->request->getVar('page_buku') :
        1;

        $keyword = $this->request->getVar('keyword');
        if($keyword) {
           $buku = $this->bukuModel->search($keyword);
        }else {
            $buku = $this->bukuModel;
        }

       // $buku = $this->bukuModel->FindAll();
        $data =[
            'title' => 'Daftar Buku' ,
            'buku' => $buku->paginate(3, 'buku'),

UPDATE `buku` SET `judul` = 'SEPTI', `slug` = 'septi', `kelas` = 'XI', `penulis` = 'poppiepertiwi', `penerbit` = 'Gramedia', `sampul` = '1668229789_bd69954db0adc40fe7e3.jpeg'
WHERE `buku`.`id` IN ('33')
---
     }

        $slug = url_title($this->request->getVar('judul'), '-', true);
        $this->bukuModel->save([
            'id' => $id,
            'judul' => $this->request->getVar('judul'),
            'slug' => $slug,
            'kelas' => $this->request->getVar('kelas'),
            'penulis' => $this->request->getVar('penulis'),
            'penerbit' => $this->request->getVar('penerbit'),
            'sampul' => $namaSampul
        ]);