app/Models/BukuModel.php

    public function getBuku($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }
        return $this->where(['slug' => $slug])->first();
---
SELECT *
FROM `buku`
WHERE `slug` = 'septihan'
 LIMIT 1